## **Python Bootcamp - Unit 5**
---
**Author:** David Dobolyi

**Key Concepts**
- [Importable Data Structures](#Importable-Data-Structures)
    - [NumPy Arrays](#NumPy-Arrays)
        - [Accessing Array Elements](#Accessing-Array-Elements)
        - [Updating Array Elements](#Updating-Array-Elements)
        - [Adding Array Elements](#Adding-Array-Elements)
        - [Deleting Array Elements](#Deleting-Array-Elements)
        - [Joining Arrays](#Joining-Arrays)
        - [Other Array Methods](#Other-Array-Methods)
        - [Multidimensional Arrays](#Multidimensional-Arrays)
    - [pandas DataFrames](#pandas-DataFrames)
        - [Reading and Viewing Data](#Reading-and-Viewing-Data)
        - [Setting Data Types](#Setting-Data-Types)
        - [Accessing DataFrame Elements](#Accessing-DataFrame-Elements)
        - [Bitwise Operators and Querying](#Bitwise-Operators-and-Querying)
        - [Updating DataFrame Elements](#Updating-DataFrame-Elements)
        - [Adding DataFrame Elements](#Adding-DataFrame-Elements)
        - [Deleting DataFrame Elements](#Deleting-DataFrame-Elements)
        - [Renaming Indexes](#Renaming-Indexes)
        - [Joining DataFrames](#Joining-DataFrames)
        - [Grouping and Aggregate Functions](#Grouping-and-Aggregate-Functions)
        - [Writing Data](#Writing-Data)
        - [Other DataFrame Methods](#Other-DataFrame-Methods)
    - [pandas Series](#pandas-Series)

---
### Importable Data Structures

In addition to built-in data structures such as *lists*, Python supports importing a variety of useful external data structures. As mentioned in the previous unit, two essential examples of these used in data science include:

- [numpy.array](https://numpy.org/devdocs/reference/generated/numpy.array.html)
- [pandas.DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

These two data structures will be covered in this unit, along with a brief introduction to a relevant structure, [pandas.Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html).

#### NumPy Arrays

When working with data, it is extremely common to store data into *NumPy arrays*, which are very similar conceptually to Python's built-in *lists*. There are a few key advantages of using NumPy arrays however, including:

- Lower memory utilization
- Better performance
- Additional convienent methods and features related to mathematical operations

An overview of the advantages of NumPy arrays is available on the [official site](https://numpy.org/devdocs/user/whatisnumpy.html). Moreover, the [user guide](https://numpy.org/devdocs/user/index.html) and [reference manual](https://numpy.org/devdocs/reference/index.html) provide an excellent resource for utilizing all of NumPy's functionality.

In this bootcamp, we will cover some of the core features via examples similar to how we covered lists in the previous unit. The primary focus will be on the *ndarray* class, otherwise referred to as a *numpy.array*, which is a ***homogenous*** multidimensional array. The homogenous distinction is important, since as we will see in the following section, NumPy arrays may only contain data of a single data type, similar to arrays in R (see this list of supported [data types](https://numpy.org/devdocs/user/basics.types.html) for additional details).

Before we create our first NumPy array, note that we'll need to import (and possibly install) the NumPy package (see Unit 2 for help):

In [1]:
import numpy as np

The code above will import the NumPy package with the alias `np` to condense our code.

Moving on to creating an array, the NumPy user guide covers the [basics](https://numpy.org/devdocs/user/basics.creation.html) in detail, but we will do a simple example together.

While NumPy arrays can be created intrinsically, they are more commonly either created when reading in data or converting from existing data structures. For example, suppose we had the following list object containing numbers:

In [2]:
[5, 3, 2, 5, 6]

[5, 3, 2, 5, 6]

Currently, these data are obviously in `list` form:

In [3]:
type([5, 3, 2, 5, 6])

list

To transition these to a NumPy array, we could write the following code:

In [4]:
np.array([5, 3, 2, 5, 6])

array([5, 3, 2, 5, 6])

Notice how the result makes it explicit that we are now working with the data in `numpy.ndarray` form:

In [5]:
type(np.array([5, 3, 2, 5, 6]))

numpy.ndarray

This output shows we have our data in the desired NumPy array format. Note that we could also have conducted the same set of operations above using a named variable:

In [6]:
myList = [5, 3, 2, 5, 6]
myArray = np.array(myList)
display(myArray, type(myArray))

array([5, 3, 2, 5, 6])

numpy.ndarray

Regardless of how we created or stored it, our NumPy array is automatically set to a valid data type for the data we provided as shown via the *dtype* method:

In [7]:
myArray.dtype

dtype('int64')

In this case, because all the data in the array contained integers, the dtype (i.e., data type) is automatically set to either `int32` or `int64` depending upon the operating system. For a full list of data type options, consult the NumPy documentation (e.g., [data types](https://numpy.org/devdocs/user/basics.types.html), which was linked earlier). By using specific data types that have constraints on the data they can hold, NumPy can be useful for making your analyses more efficient (e.g., for small integers such as the ones in this example, `int8` would have potentially been more efficient than the default, although these distinctions are technical and outside the scope of this bootcamp).

Be sure to always consider the data type as you work with your NumPy arrays, as discussed in a previous unit:

In [8]:
myFloatArray = np.array([4.5, 6.5, 4.5, 5.5])
display(myFloatArray, myFloatArray.dtype)

array([4.5, 6.5, 4.5, 5.5])

dtype('float64')

In [9]:
myStrArray = np.array(['cat', 'dog', 'fish', 'hamster'])
display(myStrArray, myStrArray.dtype)

array(['cat', 'dog', 'fish', 'hamster'], dtype='<U7')

dtype('<U7')

Various additional methods are available for NumPy arrays to better understand the properties of the data you are working with. For instance:

In [10]:
display(myArray.ndim, myArray.size, myArray.shape)

1

5

(5,)

This output shows the number of dimensions of the array, the size of the array, and the shape of the array, respectively. Note that the shape is essentially providing the same information as the former two outputs in condensed form.

##### **Accessing Array Elements**

Conveniently, NumPy arrays work similarly to lists and tuples in terms of how data are accessed. For example, to pull out a specific value, simply provide the relevant index:

In [11]:
myArray = np.array([5, 3, 2, 5, 6])

myArray[1]

3

Or use a negative index to pull out a value in reverse:

In [12]:
myArray[-2] # return the 2nd to last value

5

You can also use slicing to fetch multiple elements at once:

In [13]:
myArray[:3] # return the first 3 values

array([5, 3, 2])

One major advantage of arrays however is that you can use an list (or array) of values to return multiple values at once within the bracket, which is something that lists/tuples do not support:

In [14]:
myArray[[0, 2, 4]] # return the 1st, 3rd, and 5th value using a list index, i.e., [0, 2, 4]

array([5, 2, 6])

Boolean lists can also be used as a valid index as long as the number of Boolean values is identical to the length of the array itself:

In [15]:
myArray[[True, False, True, False, True]] # same result as the above

array([5, 2, 6])

Note in the example above how values in the position of a `True` are returned whereas `False` are not. This type of Boolean indexing or *mask index* can be useful for return values that correspond to a test; for instance:

In [16]:
myArray[myArray > 3]

array([5, 5, 6])

Notice how the code above returns only those values of myArray that are greater than the specificied condition (i.e., > 3).

Collectively, these examples cover the key basics of accessing data within arrays. For further information, consult the relevant documentation on [indexing](https://numpy.org/devdocs/user/basics.indexing.html).

##### **Updating Array Elements**

Updating elements in an array works very similarly to how it does for lists and tuples. Simply reference location(s) via an index and assign new values:

In [17]:
myArray = np.array([5, 3, 2, 5, 6])

myArray[2] = 300 # assign the 3rd value to 300

myArray

array([  5,   3, 300,   5,   6])

In [18]:
myArray[[0, 4]] = [100, 500] # assign the first and fifth values to 100 and 500 respectively

myArray

array([100,   3, 300,   5, 500])

Note that any valid index can be used, including slices and masks. Moreover, it's possible to change multiple values to the same new value at once by providing only a single value on the right-hand side of the `=` (a *broadcastable* value):

In [19]:
myArray[1:3] = -5 # assign the 2nd through 3rd values -5

myArray

array([100,  -5,  -5,   5, 500])

In [20]:
myArray[myArray > 0] = 5 # assign values greater than 0 the value of 5
myArray

array([ 5, -5, -5,  5,  5])

[Broadcasting](https://docs.scipy.org/doc/numpy/user/basics.broadcasting.html) is a powerful feature that provides functionality similar to R. By providing compatible values of the right *shape*, it's possible to make updates more programmatic. For instance:

In [21]:
myArray = np.array([5, 3, 2, 5, 6])

myArray += 10 # in other words, myArray = myArray + 10

myArray

array([15, 13, 12, 15, 16])

Using this functionality, it's also possible to add two arrays of the same length:

In [22]:
myArrayA = np.array([5, 3, 2, 5, 6])
myArrayB = np.array([1, 2, 3, 4, 5])

myArrayA + myArrayB

array([ 6,  5,  5,  9, 11])

##### **Adding Array Elements**

To add an element to a NumPy array, you can use the *append* function, which in the case of arrays supports adding multiple values:

In [23]:
myArray = np.array([5, 3, 2, 5, 6])

np.append(myArray, [10, 20, 30])

array([ 5,  3,  2,  5,  6, 10, 20, 30])

To insert a value in a specific position use the *insert* function:

In [24]:
np.insert(myArray, 1, [-10, -20, -30])

array([  5, -10, -20, -30,   3,   2,   5,   6])

Note that neither appending nor inserting is performed in-place, so to actually add the desired elements, you would need to perform assignment:

In [25]:
myArray = np.insert(myArray, 1, [-10, -20, -30])

myArray

array([  5, -10, -20, -30,   3,   2,   5,   6])

Finally, note that you can insert multiple values in a list of index locations at once (relative to the original array's index locations):

In [26]:
np.insert(myArray, [1, 3, 5], [-10, -20, -30])

array([  5, -10, -10, -20, -20, -30,   3, -30,   2,   5,   6])

##### **Deleting Array Elements**

To delete and array element, use the aptly-named *delete* function:

In [27]:
myArray = np.array([5, 3, 2, 5, 6])

myArray = np.delete(myArray, 1) # remove 2nd element
myArray

array([5, 2, 5, 6])

To delete multiple elements at once, use any valid indexing method that involves multiple values; for instance:

In [28]:
myArray = np.array([5, 3, 2, 5, 6])

myArray = np.delete(myArray, [0, 4]) # remove the 1st and 5th elements
myArray

array([3, 2, 5])

##### **Joining Arrays**

To combine two or more arrays, you use the *concatenate* function (and note, since multiple arrays can be added, the `+` approach that works for lists does not apply to arrays):

In [29]:
myArrayA = np.array([5, 3, 2, 5, 6])
myArrayB = np.array([1, 2, 3, 4, 5])

myCombinedArray = np.concatenate([myArrayA, myArrayB])
myCombinedArray

array([5, 3, 2, 5, 6, 1, 2, 3, 4, 5])

Alternatively, you if you are working with only two arrays, you could also have used the *append* approach from earlier:

In [30]:
myCombinedArray = np.append(myArrayA, myArrayB)
myCombinedArray

array([5, 3, 2, 5, 6, 1, 2, 3, 4, 5])

##### **Other Array Methods**

NumPy supports a wide range of additional functionality. For a complete list, see the [reference manual](https://docs.scipy.org/doc/numpy/reference/index.html).

Moreover, note that many methods for working with data sequences will also apply to arrays. For instance, the same approach for getting the length of a list applies to an array:

In [31]:
# len (return the length of the array)
myArray = np.array([5, 3, 2, 5, 6])
len(myArray)

5

Arrays can also be sorted in a similar fashion to lists:

In [32]:
# sort (sort the list)
myArray = np.array([5, 3, 2, 5, 6])
myArray.sort()
myArray

array([2, 3, 5, 5, 6])

Finally, additional NumPy functions are available for a variety of common use cases. For example, to quickly determine which values within an array satisfy a condition (e.g., to create a new variable), use *where*:

In [33]:
myArray = np.array([5, 3, 2, 5, 6])
np.where(myArray >= 4, True, False) # where myArray >= 4 True, otherwise False

array([ True, False, False,  True,  True])

In [34]:
myArray = np.array([5, 3, 2, 5, 6])
np.where(myArray >= 4, myArray, 0) # where myArray >= 4 keep the existing value, otherwise substitute 0

array([5, 0, 0, 5, 6])

We can also use *where* to find the indicies that satisfy a condition:

In [35]:
myArray = np.array([5, 3, 2, 5, 6])
np.where(myArray >= 4) # return the indicies where where myArray >= 4

(array([0, 3, 4]),)

Again, consult the reference manual for additional approaches for working with arrays.

##### **Multidimensional Arrays**

While not a focus for this bootcamp, arrays can be multidimensional. For example, consider the following 2 x 3 array:

In [36]:
myMultidimensionalArray = np.array([[1, 2, 3], [2, 5, 6]])
myMultidimensionalArray

array([[1, 2, 3],
       [2, 5, 6]])

The methods discussed earlier when introducing arrays provide relevant information regarding our multidimensional array (i.e., in terms of dimensions, size, and shape):

In [37]:
display(myMultidimensionalArray.ndim, myMultidimensionalArray.size, myMultidimensionalArray.shape)

2

6

(2, 3)

Multidimensional arrays can be indexed using row, column syntax within square brackets:

In [38]:
myMultidimensionalArray[1, 1] # second row, second value

5

Various methods allow for manipulating such arrays in useful ways. For instance, to transpose our array, we could do the following:

In [39]:
np.transpose(myMultidimensionalArray)

array([[1, 2],
       [2, 5],
       [3, 6]])

For additional information on multidimensional arrays, consult the [reference](https://numpy.org/devdocs/reference/arrays.ndarray.html).

#### pandas DataFrames

The [pandas](https://pandas.pydata.org/) package is invaluable for working with *rectangular* data (i.e., data with rows and columns, also known as *tabular*). The package itself is versatile, offering a flexibile data structure (pandas.DataFrame) as well as methods and functions for data reading, data manipulation, and analysis.

The pandas website includes valuable resources for learning how to use the package, include a [getting started](https://pandas.pydata.org/docs/getting_started/index.html) guide, which includes an abbreviated, [10-minute introduction](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) as well as a full [user guide](https://pandas.pydata.org/docs/user_guide/index.html) and [reference manual](https://pandas.pydata.org/docs/reference/index.html) for advanced users.

This bootcamp will focus on the core fundamentals necessary to work with pandas. Before we get started, be sure the pandas package installed and imported (or see Unit 2 for help on this):

In [40]:
import pandas as pd

##### **Reading and Viewing Data**

Although it's possible to define a pandas DataFrame object via code directly (e.g., see [these examples](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#dataframe)), in data science it's more common to generate them by reading in external data files. For example, suppose you have a comma-separate value (CSV) file named "ExampleData.csv" stored in a subfolder named "data" relative to this Jupyter notebook (**note:** for a review of how paths work -- including relative files and folders -- see Unit 4 of my [***R Bootcamp***](https://github.com/davedgd/r-bootcamp); this information will eventually be duplicated here as well, but for now, note the following magic keywords:

- `%pwd`: print the working directory for a notebook (similar to getwd in R)
- `%cd`: change the working directory for a notebook (similar to setwd in R); note that the working directory you specify after the command does not need to be in quotes (e.g., `%cd ~/Downloads`), but if quotes are used, be sure to use double quotes (e.g., `%cd "~/Downloads"`) on Windows
- `%ls`: list the files in the notebook's current working directory (similar to list.files in R)

To read those data in, you could do the following:

In [41]:
myDF = pd.read_csv('data/ExampleData.csv')

In the code above, the read function *read_csv* takes a path argument that specifies the file we want to read in (i.e., `ExampleData.csv`) along with its relative location (i.e., in the folder `data`). Pandas natively supports reading from several common formats including:

- [read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html): CSV (comma-separated values)
- [read_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#pandas.read_excel): XLS, XLSX (Microsoft Excel); note that you'll need to install openpyxl to work
- [read_spss](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_spss.html#pandas.read_spss): SAV (IBM SPSS)

For a full list of supported formats, see the [input/output documentation](https://pandas.pydata.org/pandas-docs/stable/reference/io.html).

Most of these functions will return the data in the form of a *DataFrame*. We can verify this using code as always:

In [42]:
type(myDF)

pandas.core.frame.DataFrame

To see the data in full, simply call it back (although note this may not be the best idea for very large data sets); note that missing data will be shown as `NaN` (see the NumPy reference for more details on [missing data](https://numpy.org/devdocs/reference/constants.html#numpy.NaN)):

In [43]:
myDF

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63,1,M,31124.56,FullTime,5.0
1,1002,Milton,McPhaden,Recruiter,mmcphaden1@marriott.com,20,2,L,65875.74,FullTime,3.0
2,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41,2,3XL,25548.53,FullTime,4.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43,1,S,51447.79,PartTime,5.0
4,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41,0,L,54961.71,PartTime,5.0
5,1006,Cora,Barbary,Research Associate,cbarbary5@china.com.cn,61,1,XL,31398.06,PartTime,5.0
6,1007,Stevie,O'Shirine,VP Accounting,soshirine6@foxnews.com,55,0,XS,65814.42,FullTime,3.0
7,1008,Kynthia,Blaxley,Computer Systems Analyst IV,kblaxley7@goo.ne.jp,63,2,S,65262.16,PartTime,NaN
8,1009,Harmony,Kaysor,Chemical Engineer,NaN,58,3,M,41974.19,PartTime,3.0
9,1010,Levi,Elward,Staff Accountant II,lelward9@sitemeter.com,50,1,2XL,66769.71,FullTime,4.0
10,1011,Hobard,Seyers,Executive Secretary,hseyersa@mlb.com,49,1,2XL,37632.39,PartTime,2.0
11,1012,Roselle,Rideout,Paralegal,rrideoutb@bravesites.com,58,2,2XL,90149.96,FullTime,1.0
12,1013,Brigitta,Ganny,Structural Engineer,bgannyc@oakley.com,65,1,3XL,25491.98,FullTime,1.0
13,1014,Wilma,Yeo,Sales Associate,wyeod@techcrunch.com,30,0,3XL,27012.52,PartTime,4.0
14,1015,Vlad,Parlett,Sales Representative,vparlette@t.co,39,0,3XL,24171.09,FullTime,3.0
15,1016,Bernie,Senechell,Senior Editor,bsenechellf@walmart.com,64,0,2XL,60180.50,NaN,5.0
16,1017,Marline,Goodee,Programmer Analyst IV,mgoodeeg@blogtalkradio.com,24,2,L,61362.33,FullTime,1.0
17,1018,Josselyn,Lumbley,Research Assistant III,NaN,50,0,XL,76692.87,PartTime,5.0
18,1019,Mandie,Donan,Research Assistant IV,mdonani@nytimes.com,31,0,M,64495.01,PartTime,4.0
19,1020,Kassandra,Openshaw,Director of Sales,NaN,24,1,2XL,56248.84,FullTime,3.0
20,1021,Beryl,Shalloe,Health Coach I,bshalloek@twitter.com,60,3,XL,22387.88,PartTime,4.0
21,1022,Terra,Gilliatt,Health Coach II,tgilliattl@businessweek.com,35,0,S,40816.42,FullTime,2.0
22,1023,Carrol,Pochon,Professor,cpochonm@google.it,20,2,2XL,59710.47,PartTime,1.0
23,1024,Harmony,Powley,Legal Assistant,NaN,18,3,S,21668.06,FullTime,3.0
24,1025,Seana,Haskins,Environmental Tech,shaskinso@drupal.org,43,1,XS,39609.89,FullTime,4.0
25,1026,Pearce,Ygoe,Cost Accountant,pygoep@webnode.com,34,1,L,45988.08,PartTime,5.0
26,1027,Dmitri,Mattisson,Administrative Officer,dmattissonq@nyu.edu,49,3,M,35535.96,PartTime,4.0
27,1028,Ashton,Beaby,Developer I,abeabyr@imdb.com,23,0,XL,83948.68,FullTime,2.0
28,1029,Allan,Stoffersen,Nurse,astoffersens@amazon.de,39,2,XS,47142.61,PartTime,NaN
29,1030,Stepha,Forth,Automation Specialist I,sfortht@thetimes.co.uk,63,0,S,78520.42,FullTime,2.0
30,1031,Theobald,Crosbie,Project Manager,tcrosbieu@shinystat.com,40,3,3XL,81379.92,FullTime,3.0
31,1032,Wash,Mechem,Operator,wmechemv@techcrunch.com,23,1,L,91838.16,FullTime,2.0
32,1033,Scarlett,Laval,Human Resources Assistant II,slavalw@bandcamp.com,63,3,XS,84602.89,PartTime,4.0
33,1034,Garwin,Farnish,Human Resources Assistant IV,gfarnishx@wufoo.com,53,0,L,83878.78,PartTime,5.0
34,1035,Donna,Stollen,Media Manager IV,dstolleny@creativecommons.org,56,2,M,61861.03,FullTime,1.0
35,1036,Aldous,Derill,Assistant Media Planner,aderillz@wired.com,36,0,M,52298.58,PartTime,3.0
36,1037,Karola,Hadland,General Manager,khadland10@php.net,28,0,L,88994.74,FullTime,4.0
37,1038,Paulie,Lunge,Senior Developer,plunge11@qq.com,36,2,L,20496.78,PartTime,5.0
38,1039,Emmalee,Ferris,Geological Engineer,eferris12@google.it,57,3,XS,57157.43,PartTime,NaN
39,1040,Analise,Prichard,Junior Executive,aprichard13@wufoo.com,24,3,XL,49072.96,NaN,3.0
40,1041,Jeana,Mixer,GIS Technical Architect,jmixer14@csmonitor.com,53,3,S,22700.51,PartTime,1.0
41,1042,Miner,Pascho,Registered Nurse,mpascho15@reddit.com,40,0,M,42017.65,PartTime,1.0
42,1043,Sherlocke,Lammert,Financial Analyst,slammert16@rambler.ru,23,1,2XL,74965.35,PartTime,3.0
43,1044,Harriett,German,Research Associate,hgerman17@ibm.com,19,3,XS,52513.35,PartTime,5.0
44,1045,Nessa,McGaugey,Clinical Specialist,nmcgaugey18@salon.com,37,3,XL,49928.91,PartTime,3.0
45,1046,Pammy,Berndsen,Cost Accountant,pberndsen19@vistaprint.com,44,2,XS,38783.31,FullTime,3.0
46,1047,Tyne,Ostick,Assistant Media Planner,tostick1a@hibu.com,51,3,L,27754.88,PartTime,4.0
47,1048,Timmie,Roffey,Programmer I,troffey1b@hatena.ne.jp,20,1,M,86393.21,PartTime,5.0
48,1049,Shane,Lehon,Software Engineer IV,slehon1c@istockphoto.com,27,2,L,37648.58,PartTime,3.0
49,1050,Bert,Feasley,Nurse Practicioner,NaN,38,0,XL,21330.46,FullTime,2.0

A better alternative to simply calling up the data would be to call up only a few rows to inspect the contents via the *head* or *tail* methods:

In [44]:
myDF.head() # see the first 5 rows (default)

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63,1,M,31124.56,FullTime,5.0
1,1002,Milton,McPhaden,Recruiter,mmcphaden1@marriott.com,20,2,L,65875.74,FullTime,3.0
2,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41,2,3XL,25548.53,FullTime,4.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43,1,S,51447.79,PartTime,5.0
4,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41,0,L,54961.71,PartTime,5.0

In [45]:
myDF.tail(2) # see the last 2 rows

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
48,1049,Shane,Lehon,Software Engineer IV,slehon1c@istockphoto.com,27,2,L,37648.58,PartTime,3.0
49,1050,Bert,Feasley,Nurse Practicioner,NaN,38,0,XL,21330.46,FullTime,2.0

In [46]:
myDF.sample(5) # see 5 random rows

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
16,1017,Marline,Goodee,Programmer Analyst IV,mgoodeeg@blogtalkradio.com,24,2,L,61362.33,FullTime,1.0
39,1040,Analise,Prichard,Junior Executive,aprichard13@wufoo.com,24,3,XL,49072.96,NaN,3.0
36,1037,Karola,Hadland,General Manager,khadland10@php.net,28,0,L,88994.74,FullTime,4.0
48,1049,Shane,Lehon,Software Engineer IV,slehon1c@istockphoto.com,27,2,L,37648.58,PartTime,3.0
18,1019,Mandie,Donan,Research Assistant IV,mdonani@nytimes.com,31,0,M,64495.01,PartTime,4.0

Additional methods are available to help understand what the properties of the data you are working with, including:

In [47]:
myDF.columns # see the complete index of column names

Index(['id', 'first_name', 'last_name', 'job_title', 'email', 'age',
       'num_children', 'shirt_size', 'annual_salary', 'pay_type',
       'satisfaction_score'],
      dtype='object')

In [48]:
myDF.index  # see the row indicies

RangeIndex(start=0, stop=50, step=1)

In [49]:
myDF.shape # see the number of rows and columns as a tuple (for just rows or columns, use myDF.shape[0] or myDF.shape[1], respectively)

(50, 11)

In [50]:
myDF.dtypes  # see the data types of each column (i.e., each column may only contain 1 data type, similar to NumPy arrays)

id                      int64
first_name             object
last_name              object
job_title              object
email                  object
age                     int64
num_children            int64
shirt_size             object
annual_salary         float64
pay_type               object
satisfaction_score    float64
dtype: object

Moreover, you can use the *describe* method to quickly see basic descriptives for all the numeric data (i.e., `int` and `float` types from the list above in this case):

In [51]:
myDF.describe()

               id        age  num_children  annual_salary  satisfaction_score
count    50.00000  50.000000     50.000000       50.00000           47.000000
mean   1025.50000  41.620000      1.400000    52491.20620            3.255319
std      14.57738  14.752226      1.160577    21633.09159            1.358837
min    1001.00000  18.000000      0.000000    20496.78000            1.000000
25%    1013.25000  28.500000      0.000000    36060.06750            2.000000
50%    1025.50000  40.500000      1.000000    51873.18500            3.000000
75%    1037.75000  54.500000      2.000000    65860.41000            4.000000
max    1050.00000  65.000000      3.000000    91838.16000            5.000000

Finally, in terms of organizing how you view the data, you can also sort using various methods including *sort_values*:

In [52]:
# show the first ten employees in the data and sort them by satisfaction_score in descending order (i.e., ascending = False)
myDF.head(10).sort_values('satisfaction_score', ascending = False)

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63,1,M,31124.56,FullTime,5.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43,1,S,51447.79,PartTime,5.0
4,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41,0,L,54961.71,PartTime,5.0
5,1006,Cora,Barbary,Research Associate,cbarbary5@china.com.cn,61,1,XL,31398.06,PartTime,5.0
2,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41,2,3XL,25548.53,FullTime,4.0
9,1010,Levi,Elward,Staff Accountant II,lelward9@sitemeter.com,50,1,2XL,66769.71,FullTime,4.0
1,1002,Milton,McPhaden,Recruiter,mmcphaden1@marriott.com,20,2,L,65875.74,FullTime,3.0
6,1007,Stevie,O'Shirine,VP Accounting,soshirine6@foxnews.com,55,0,XS,65814.42,FullTime,3.0
8,1009,Harmony,Kaysor,Chemical Engineer,NaN,58,3,M,41974.19,PartTime,3.0
7,1008,Kynthia,Blaxley,Computer Systems Analyst IV,kblaxley7@goo.ne.jp,63,2,S,65262.16,PartTime,NaN

Conveniently, note that methods can be combined into a single call. For example, to sort the data and only show the first 10 rows, we could couple the *sort_values* method with *head*:

In [53]:
# sort the values first, and then show the top 10
myDF.sort_values('satisfaction_score', ascending = False).head(10)

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63,1,M,31124.56,FullTime,5.0
43,1044,Harriett,German,Research Associate,hgerman17@ibm.com,19,3,XS,52513.35,PartTime,5.0
15,1016,Bernie,Senechell,Senior Editor,bsenechellf@walmart.com,64,0,2XL,60180.50,NaN,5.0
25,1026,Pearce,Ygoe,Cost Accountant,pygoep@webnode.com,34,1,L,45988.08,PartTime,5.0
33,1034,Garwin,Farnish,Human Resources Assistant IV,gfarnishx@wufoo.com,53,0,L,83878.78,PartTime,5.0
37,1038,Paulie,Lunge,Senior Developer,plunge11@qq.com,36,2,L,20496.78,PartTime,5.0
5,1006,Cora,Barbary,Research Associate,cbarbary5@china.com.cn,61,1,XL,31398.06,PartTime,5.0
4,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41,0,L,54961.71,PartTime,5.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43,1,S,51447.79,PartTime,5.0
47,1048,Timmie,Roffey,Programmer I,troffey1b@hatena.ne.jp,20,1,M,86393.21,PartTime,5.0

Be aware that the order you use for the various operations matters. For instance, in the two examples above, the result is very different in either case of:

- pulling the top ten values and then sorting (i.e., the former example)
- sorting and subsequently pulling the top 10 values (i.e., the latter example)

##### **Setting Data Types**

In the previous section, we showed that the *dtypes*  property can be used to see the data types of each column in the DataFrame:

In [54]:
myDF.dtypes

id                      int64
first_name             object
last_name              object
job_title              object
email                  object
age                     int64
num_children            int64
shirt_size             object
annual_salary         float64
pay_type               object
satisfaction_score    float64
dtype: object

Most of the data types that appear in this list are related to the primitive types discussed in a previous unit (e.g., `int` and `float`). That said, the actual data types in the list above are not exactly the same since the bulk of them come from [NumPy](https://numpy.org/doc/stable/user/basics.types.html), although some--such as [category](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html)--are specific to [pandas]([supported](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#dtypes)). Additionally, it is worth noting that `object` is a general data type that is used for `str` and various mixed data types in pandas.

More importantly, when reading in the data, pandas will make an effort to set each column to a reasonable data type, but often you will need to change it. To accomplish this, we use the *astype* function. For example, to change the id column from an `int64` (or `int32`, depending upon your system default) to an `uint8` (since ages should never be negative and rarely take high values), we can do the following:

In [55]:
myDF.age = myDF.age.astype('uint8')

myDF.dtypes

id                      int64
first_name             object
last_name              object
job_title              object
email                  object
age                     uint8
num_children            int64
shirt_size             object
annual_salary         float64
pay_type               object
satisfaction_score    float64
dtype: object

To change multiple columns at once, we can use the following syntax:

In [56]:
myDF = myDF.astype({
    'age': 'float',
    'pay_type': 'category',
    'shirt_size': 'category'
})

myDF.dtypes

id                       int64
first_name              object
last_name               object
job_title               object
email                   object
age                    float64
num_children             int64
shirt_size            category
annual_salary          float64
pay_type              category
satisfaction_score     float64
dtype: object

In this example, we converted (or *cast*) age from `int64` to `float64` and set shirt_size and pay_type to `category`. The latter data type of `category` is interesting, since it works much like a *factor* in R as noted in the [documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html). For variables such as shirt_size where there are only a fixed set of possibiltiies, treating the variable as categorical often makes the most sense, and may be necessary for conducting various analyses (e.g., ANOVAs).

More generally, it is important to check the data types (i.e., using *dtypes*) when importing your data and making sure all the data are coded correctly prior to moving on with data analysis.

##### **Accessing DataFrame Elements**

All of the examples thus far have focused on viewing all of the data at once. However, it's often desirable to access specific data points, such as one or more columns or a specific set of rows across particular columns. Pandas provides several approaches for accessing elements in this way. For example, to reference a particular column, you can do so by name via bracket notation:

In [57]:
myDFShort = myDF.head() # create a shorter version of the DataFrame to avoid having to constantly call head

In [58]:
myDFShort['first_name']

0     Cobbie
1     Milton
2    Coralyn
3     Morten
4     Norman
Name: first_name, dtype: object

For a single column, it's also possible to use the following shorthand notation to achieve the same result:

In [59]:
myDFShort.first_name

0     Cobbie
1     Milton
2    Coralyn
3     Morten
4     Norman
Name: first_name, dtype: object

In both cases, pandas conveniently notes the name of the column as well as the data type (i.e., dtype) clearly in the result.

To access multiple columns, stick to the bracketing approach and supply a list of named column indicies (i.e., double brackets):

In [60]:
myDFShort[['first_name', 'last_name', 'age']]

  first_name   last_name   age
0     Cobbie     Whinray  63.0
1     Milton    McPhaden  20.0
2    Coralyn  Haselhurst  41.0
3     Morten     Samples  43.0
4     Norman      Munnis  41.0

In addition to selecting specific columns, we can also return specific rows using brackets by providing an index or slice:

In [61]:
myDFShort[2:4] # select the 3rd and 4th rows by position

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
2,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41.0,2,3XL,25548.53,FullTime,4.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43.0,1,S,51447.79,PartTime,5.0

More formally, we can achieve this affect using the powerful *loc* method:

In [62]:
myDFShort.loc[2] # select by literal row index value

id                                    1003
first_name                         Coralyn
last_name                       Haselhurst
job_title              Account Coordinator
email                 chaselhurst2@icio.us
age                                   41.0
num_children                             2
shirt_size                             3XL
annual_salary                     25548.53
pay_type                          FullTime
satisfaction_score                     4.0
Name: 2, dtype: object

The *loc* approach offers a lot of options. For example, we can use it to reference rows using named labels instead of via index values.

First, we need to set the DataFrame's index to a relevant column using the *set_index* method; in this case, we'll use `id`:

In [63]:
myDFShort.set_index('id', inplace = True, drop = False) # set id as the labelled index (in-place) without dropping the column set as the index
myDFShort

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
id,,,,,,,,,,,
1001,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63.0,1,M,31124.56,FullTime,5.0
1002,1002,Milton,McPhaden,Recruiter,mmcphaden1@marriott.com,20.0,2,L,65875.74,FullTime,3.0
1003,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41.0,2,3XL,25548.53,FullTime,4.0
1004,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43.0,1,S,51447.79,PartTime,5.0
1005,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41.0,0,L,54961.71,PartTime,5.0

Note we can re-check the current index values via the *index* property discussed earlier:

In [64]:
myDFShort.index

Int64Index([1001, 1002, 1003, 1004, 1005], dtype='int64', name='id')

The data type of the index is consistent with what it was for the column (i.e., `int64`), which will be relevant to how we use values as a row reference. For example, to pull up two specific employees by `id`, we can supply a list of integer index values to *loc* to pull up these particular results:

In [65]:
myDFShort.loc[[1001, 1005]] # return specific people via the newly established id index

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
id,,,,,,,,,,,
1001,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63.0,1,M,31124.56,FullTime,5.0
1005,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41.0,0,L,54961.71,PartTime,5.0

In addition, using *loc* we can reference both rows and columns simultaneously:

In [66]:
myDFShort.loc[:, ['first_name', 'last_name', 'age']] # return all rows and selected columns

     first_name   last_name   age
id
1001     Cobbie     Whinray  63.0
1002     Milton    McPhaden  20.0
1003    Coralyn  Haselhurst  41.0
1004     Morten     Samples  43.0
1005     Norman      Munnis  41.0

In [67]:
myDFShort.loc[[1001, 1005], ['first_name', 'last_name', 'age']] # return named index values and selected columns

     first_name last_name   age
id
1001     Cobbie   Whinray  63.0
1005     Norman    Munnis  41.0

If desired, we could also reset the index and use *loc* with a mixture of `int` row index values based on a range and `str` columns labels:

In [68]:
myDFShort.reset_index(inplace = True, drop = True) # reset the index and completely drop the existing id labels (since we kept them as a column earlier)
myDFShort.index

RangeIndex(start=0, stop=5, step=1)

In [69]:
myDFShort.loc[2:4, ['first_name', 'last_name', 'age']] # return rows 2

  first_name   last_name   age
2    Coralyn  Haselhurst  41.0
3     Morten     Samples  43.0
4     Norman      Munnis  41.0

Somewhat confusingly (and as shown above), it's important to note that for loc row indexing via slices, the range of values returned is **inclusive** unlike what's typical for lists when the values consist of integers. For `str` based index values, referencing via *loc* is less ambiguous (e.g., if we'd used `email` as our index via *set_index*, then we could pull up certain people via email using a list of `str` values such as `['cwhinray0@icq.com', 'nmunnis4@cargocollective.com']`, which would correspond to `id` column values `[1001, 1005]`, respectively).

For positional slicing that works similar to lists, you must use the *iloc* method instead:

In [70]:
myDFShort.iloc[2:4, 1:3] # return the 3rd and 4th rows and the 2nd and 3rd columns

  first_name   last_name
2    Coralyn  Haselhurst
3     Morten     Samples

In general however, it's best to avoid referencing columns by position since column order is arbitrary and could easily change as part of an analysis.

Finally, note that it's also possible to reference values using Boolean indexing, similar to NumPy arrays by using variations on the methods we've already covered -- a process often referred to as data *filtering* or *subsetting*. Consider the following examples:

In [71]:
myDFShort[myDFShort.age > 41] # select employees with an age > 41

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63.0,1,M,31124.56,FullTime,5.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43.0,1,S,51447.79,PartTime,5.0

In [72]:
myDFShort.loc[myDFShort.num_children >= 1, ['first_name', 'last_name', 'age', 'num_children']] # select specific columns for employees with 1 or more children

  first_name   last_name   age  num_children
0     Cobbie     Whinray  63.0             1
1     Milton    McPhaden  20.0             2
2    Coralyn  Haselhurst  41.0             2
3     Morten     Samples  43.0             1

##### **Bitwise Operators and Querying**

In addition to the prior examples involving Boolean indexing, note that it is possible to set up more complex filters using multiple conditions simultaneously using *logical statements*. Somewhat confusingly, rather than using Boolean operators (which were introduced in an earlier unit) to set these up, you must use *bitwise operator* equivalents:

- **or**: `|`
- **and**: `&`
- **not**: `~`

For instance, suppose you wanted to find employees who have at least one child **and** are older than 42. To do this, you could write the following code:

In [73]:
myDFShort.loc[(myDFShort.num_children >= 1) & (myDFShort.age > 42), ['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

  first_name last_name   age  num_children  satisfaction_score
0     Cobbie   Whinray  63.0             1                 5.0
3     Morten   Samples  43.0             1                 5.0

Alternatively, suppose you wanted to find employees who have an annual salary less than 20,000 **or** a satisfaction score not equal to five:

In [74]:
myDFShort.loc[(myDFShort.annual_salary < 20000) | (myDFShort.satisfaction_score != 5), ['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

  first_name   last_name   age  num_children  satisfaction_score
1     Milton    McPhaden  20.0             2                 3.0
2    Coralyn  Haselhurst  41.0             2                 4.0

The prior example could have been written using `~` to achieve the same result with a slightly different latter condition:

In [75]:
myDFShort.loc[(myDFShort.annual_salary < 20000) | ~(myDFShort.satisfaction_score == 5), ['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

  first_name   last_name   age  num_children  satisfaction_score
1     Milton    McPhaden  20.0             2                 3.0
2    Coralyn  Haselhurst  41.0             2                 4.0

Keep the bitwise versions of Boolean operators in mind, since attempting to use the latter will result in an error. For example:

In [76]:
# this does not work with and in place of &:
# myDFShort.loc[(myDFShort.num_children >= 1) and (myDFShort.age > 42), ['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

Moreover, the syntax is particular, in that parantheses are also required for the call to work:

In [77]:
# this does not work due to the lack of parentheses:
# myDFShort.loc[myDFShort.num_children >= 1 & myDFShort.age > 42, ['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

As an alternative, it is strongly recommended you use pandas' *query* method for more advanced queries since the syntax is simpler and more readable:

In [78]:
myDFShort.query('annual_salary < 20000 | satisfaction_score != 5')[['first_name', 'last_name', 'age', 'num_children', 'satisfaction_score']]

  first_name   last_name   age  num_children  satisfaction_score
1     Milton    McPhaden  20.0             2                 3.0
2    Coralyn  Haselhurst  41.0             2                 4.0

Finally, on the subject of bitiwse operators, note that there are a handful of additional operators that are less frequently used. These include:

- **xor**: ^
- **<<**: bitwise left shift
- **>>**: bitwise right shift

Use cases for these are generally more technical; for details, see the following [page](https://wiki.python.org/moin/BitwiseOperators) for a discussion.

##### **Updating DataFrame Elements**

Similar to other data structures, updating elements involves first accessing them (e.g., via an index) and then assigning them new values. For instance, suppose we wanted to change the data for employees with a shirt size of L to M:

In [79]:
myDFShort = myDF.head().copy() # see note below regarding the need for copy

myDFShort[['id', 'first_name', 'last_name', 'email', 'shirt_size']]

     id first_name   last_name                         email shirt_size
0  1001     Cobbie     Whinray             cwhinray0@icq.com          M
1  1002     Milton    McPhaden       mmcphaden1@marriott.com          L
2  1003    Coralyn  Haselhurst          chaselhurst2@icio.us        3XL
3  1004     Morten     Samples          msamples3@toplist.cz          S
4  1005     Norman      Munnis  nmunnis4@cargocollective.com          L

*Note:* the *copy* method is necessary in the code above to avoid a caveat with how pandas handles memory (see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy) for further details).

To accomplish this, we simply need to filter the data to the relevant rows via an index using *loc* and then supply the new value(s):

In [80]:
myDFShort.loc[myDFShort.shirt_size == 'L', 'shirt_size'] = 'M' # make the change
myDFShort[['id', 'first_name', 'last_name', 'email', 'shirt_size']] # see the result

     id first_name   last_name                         email shirt_size
0  1001     Cobbie     Whinray             cwhinray0@icq.com          M
1  1002     Milton    McPhaden       mmcphaden1@marriott.com          M
2  1003    Coralyn  Haselhurst          chaselhurst2@icio.us        3XL
3  1004     Morten     Samples          msamples3@toplist.cz          S
4  1005     Norman      Munnis  nmunnis4@cargocollective.com          M

##### **Adding DataFrame Elements**

To add elements to a pandas DataFrame, we first need to decide the dimension we're adding to. In other words, are we adding new columns or new rows?

In the case of adding a column, simply supply a name for the new column and conforming data (i.e., equal to the number of rows or broadcastable) in a sequence structure using the following approach:

In [81]:
myDFSmaller = myDF.iloc[:5, :4].copy() # first we create a small subset of the data using the first 5 rows and 4 columns for this example

myDFSmaller # see the data

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

In [82]:
myDFSmaller['tenure'] = [0, 2.5, np.NaN, 5.5, 2] # 5 new values, including a missing value

myDFSmaller # see the result

     id first_name   last_name                   job_title  tenure
0  1001     Cobbie     Whinray           Account Executive     0.0
1  1002     Milton    McPhaden                   Recruiter     2.5
2  1003    Coralyn  Haselhurst         Account Coordinator     NaN
3  1004     Morten     Samples   Account Representative IV     5.5
4  1005     Norman      Munnis  Desktop Support Technician     2.0

Alternatively, we can use the the *assign* method to add one or more columns. To see this in action, let's first reset the data:

In [83]:
myDFSmaller = myDF.iloc[:5, :4].copy()

myDFSmaller # see the data

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

To add a single column such as tenure, we use the following syntax:

In [84]:
myDFSmaller = myDFSmaller.assign(tenure = [0, 2.5, np.NaN, 5.5, 2], 
                                 age = [33, 21, 45, 36, 58])

myDFSmaller # see the result

     id first_name   last_name                   job_title  tenure  age
0  1001     Cobbie     Whinray           Account Executive     0.0   33
1  1002     Milton    McPhaden                   Recruiter     2.5   21
2  1003    Coralyn  Haselhurst         Account Coordinator     NaN   45
3  1004     Morten     Samples   Account Representative IV     5.5   36
4  1005     Norman      Munnis  Desktop Support Technician     2.0   58

In the case of adding row(s), we can use the *append* method if you are combining two DataFrames. For this example, first we create two example data sets using the head and tail method:

In [85]:
myDFSmallerA = myDF.head(3).iloc[:, :4].copy()
myDFSmallerB = myDF.tail(3).iloc[:, :4].copy()

display(myDFSmallerA, myDFSmallerB)

     id first_name   last_name            job_title
0  1001     Cobbie     Whinray    Account Executive
1  1002     Milton    McPhaden            Recruiter
2  1003    Coralyn  Haselhurst  Account Coordinator

      id first_name last_name             job_title
47  1048     Timmie    Roffey          Programmer I
48  1049      Shane     Lehon  Software Engineer IV
49  1050       Bert   Feasley    Nurse Practicioner

Next, we can append the second DataFrame to the first using *append*:

In [86]:
myDFSmallerA.append(myDFSmallerB)

      id first_name   last_name             job_title
0   1001     Cobbie     Whinray     Account Executive
1   1002     Milton    McPhaden             Recruiter
2   1003    Coralyn  Haselhurst   Account Coordinator
47  1048     Timmie      Roffey          Programmer I
48  1049      Shane       Lehon  Software Engineer IV
49  1050       Bert     Feasley    Nurse Practicioner

To ignore the index, use the relevant argument:

In [87]:
myDFSmallerA.append(myDFSmallerB, ignore_index = True)

     id first_name   last_name             job_title
0  1001     Cobbie     Whinray     Account Executive
1  1002     Milton    McPhaden             Recruiter
2  1003    Coralyn  Haselhurst   Account Coordinator
3  1048     Timmie      Roffey          Programmer I
4  1049      Shane       Lehon  Software Engineer IV
5  1050       Bert     Feasley    Nurse Practicioner

Alternatively, you could also have reset the index using *reset_index* after stacking the data.

Moreover, to combine more than two DataFrames, you can also use the more general *concat* method:

In [88]:
myDF2RowsA = myDF.iloc[:2, :4].copy()
myDF2RowsB = myDF.iloc[10:12, :4].copy()
myDF2RowsC = myDF.iloc[-2:, :4].copy()

display(myDF2RowsA, myDF2RowsB, myDF2RowsC)

     id first_name last_name          job_title
0  1001     Cobbie   Whinray  Account Executive
1  1002     Milton  McPhaden          Recruiter

      id first_name last_name            job_title
10  1011     Hobard    Seyers  Executive Secretary
11  1012    Roselle   Rideout            Paralegal

      id first_name last_name             job_title
48  1049      Shane     Lehon  Software Engineer IV
49  1050       Bert   Feasley    Nurse Practicioner

In [89]:
pd.concat([myDF2RowsA, myDF2RowsB, myDF2RowsC]) # note that you must supply a sequence of DataFrames to concat

      id first_name last_name             job_title
0   1001     Cobbie   Whinray     Account Executive
1   1002     Milton  McPhaden             Recruiter
10  1011     Hobard    Seyers   Executive Secretary
11  1012    Roselle   Rideout             Paralegal
48  1049      Shane     Lehon  Software Engineer IV
49  1050       Bert   Feasley    Nurse Practicioner

If necessary, you can also ignore the index by adjusting the *ignore_index* argument:

In [90]:
pd.concat([myDF2RowsA, myDF2RowsB, myDF2RowsC], ignore_index = True)

     id first_name last_name             job_title
0  1001     Cobbie   Whinray     Account Executive
1  1002     Milton  McPhaden             Recruiter
2  1011     Hobard    Seyers   Executive Secretary
3  1012    Roselle   Rideout             Paralegal
4  1049      Shane     Lehon  Software Engineer IV
5  1050       Bert   Feasley    Nurse Practicioner

Finally, to add a single row stored as a sequence (e.g., a list) manually, you can do so via indexing (although note this approach may be unreliable if using a labelled index):

In [91]:
myDFAddOneRow = myDF.iloc[:2, :4].copy()

myDFAddOneRow.loc[len(myDFAddOneRow)] = [1234, 'Example', 'Data', 'Here'] # add a list of new values at the end programmatically

myDFAddOneRow

     id first_name last_name          job_title
0  1001     Cobbie   Whinray  Account Executive
1  1002     Milton  McPhaden          Recruiter
2  1234    Example      Data               Here

More practically, you should stick to *append* or *concat* for adding additional rows.

##### **Deleting DataFrame Elements**

To delete elements from a DataFrame, use the *drop* method while specifying an index and *axis* (i.e., `axis = 0` for rows and `axis = 1` for columns; alternatively, use `axis = 'index'` or `axis = 'columns'`, respectively). For instance, to delete specific columns, consider this example:

In [92]:
myDFSmaller = myDF.iloc[:5, :4].copy()
myDFSmaller

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

In [93]:
myDFSmaller.drop(['first_name', 'last_name'], axis = 1)

     id                   job_title
0  1001           Account Executive
1  1002                   Recruiter
2  1003         Account Coordinator
3  1004   Account Representative IV
4  1005  Desktop Support Technician

Again, for deleting rows, use `axis = 0`:

In [94]:
myDFSmaller.drop([0, 3], axis = 0) # delete (drop) the first and fourth rows

     id first_name   last_name                   job_title
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
4  1005     Norman      Munnis  Desktop Support Technician

##### **Renaming Indexes**

To rename a row or column index, use the [*rename*](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html) method. For example, to rename a column, simply supply the *column* argument with a dict object with the old and new names, respectively:

In [95]:
myDFSmaller

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

In [96]:
myDFSmaller.rename(columns = {'first_name': 'firstname', 
                              'last_name': 'lastname', 
                              'job_title': 'jobtitle'})

     id firstname    lastname                    jobtitle
0  1001    Cobbie     Whinray           Account Executive
1  1002    Milton    McPhaden                   Recruiter
2  1003   Coralyn  Haselhurst         Account Coordinator
3  1004    Morten     Samples   Account Representative IV
4  1005    Norman      Munnis  Desktop Support Technician

To rename a row index, supply a dict to the *index* argument using the relevant data types (*casting* to a different data type is also possible as explained [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)):

In [97]:
myDFSmaller.rename(index = {0: 'Zero', 2: 'Two'})

        id first_name   last_name                   job_title
Zero  1001     Cobbie     Whinray           Account Executive
1     1002     Milton    McPhaden                   Recruiter
Two   1003    Coralyn  Haselhurst         Account Coordinator
3     1004     Morten     Samples   Account Representative IV
4     1005     Norman      Munnis  Desktop Support Technician

Alternatively, you can set the row index to an existing column as well using *set_index*, which we used earlier:

In [98]:
myDFSmaller.set_index('id')

     first_name   last_name                   job_title
id
1001     Cobbie     Whinray           Account Executive
1002     Milton    McPhaden                   Recruiter
1003    Coralyn  Haselhurst         Account Coordinator
1004     Morten     Samples   Account Representative IV
1005     Norman      Munnis  Desktop Support Technician

Assuming the index has been set to a column in this manner, it is also possible to revert it using *reset_index*, which converts the row index back to a column:

In [99]:
myDFSmaller.set_index('id').reset_index()

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

##### **Joining DataFrames**

SQL-style joining is possible in pandas using *merge* as detailed in the [user guide](https://pandas.pydata.org/docs/user_guide/merging.html#merging-join). As a quick example, consider the following inner join case:

In [100]:
myDFNarrowA = myDF.loc[ :4, ['id', 'first_name', 'last_name']]
myDFNarrowB = myDF.loc[2:6, ['id', 'email', 'shirt_size']]

display(myDFNarrowA, myDFNarrowB)

     id first_name   last_name
0  1001     Cobbie     Whinray
1  1002     Milton    McPhaden
2  1003    Coralyn  Haselhurst
3  1004     Morten     Samples
4  1005     Norman      Munnis

     id                         email shirt_size
2  1003          chaselhurst2@icio.us        3XL
3  1004          msamples3@toplist.cz          S
4  1005  nmunnis4@cargocollective.com          L
5  1006        cbarbary5@china.com.cn         XL
6  1007        soshirine6@foxnews.com         XS

In [101]:
pd.merge(myDFNarrowA, myDFNarrowB, on = 'id', how = 'inner') # an inner join on 'id'

     id first_name   last_name                         email shirt_size
0  1003    Coralyn  Haselhurst          chaselhurst2@icio.us        3XL
1  1004     Morten     Samples          msamples3@toplist.cz          S
2  1005     Norman      Munnis  nmunnis4@cargocollective.com          L

In [102]:
pd.merge(myDFNarrowA, myDFNarrowB, on = 'id', how = 'outer') # an outer join on 'id'

     id first_name   last_name                         email shirt_size
0  1001     Cobbie     Whinray                           NaN        NaN
1  1002     Milton    McPhaden                           NaN        NaN
2  1003    Coralyn  Haselhurst          chaselhurst2@icio.us        3XL
3  1004     Morten     Samples          msamples3@toplist.cz          S
4  1005     Norman      Munnis  nmunnis4@cargocollective.com          L
5  1006        NaN         NaN        cbarbary5@china.com.cn         XL
6  1007        NaN         NaN        soshirine6@foxnews.com         XS

In [103]:
pd.merge(myDFNarrowA, myDFNarrowB, on = 'id', how = 'left') # a left join on 'id'

     id first_name   last_name                         email shirt_size
0  1001     Cobbie     Whinray                           NaN        NaN
1  1002     Milton    McPhaden                           NaN        NaN
2  1003    Coralyn  Haselhurst          chaselhurst2@icio.us        3XL
3  1004     Morten     Samples          msamples3@toplist.cz          S
4  1005     Norman      Munnis  nmunnis4@cargocollective.com          L

Again, see the documentation for a full set of arguments for setting up your particular join.

##### <a name = "pandasGroupingAggregateFunctions">**Grouping and Aggregate Functions**</a>

Much in the same way pandas supports SQL-style joining, it also affords the power of grouping (e.g., GROUP BY in SQL) and aggregate operations (e.g., SUM, COUNT).

To perform grouping, use the [*groupby*](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) method while supplying one or more grouping columns, which are typically categorical (although not necessarily):

In [104]:
myDF.head()

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,pay_type,satisfaction_score
0,1001,Cobbie,Whinray,Account Executive,cwhinray0@icq.com,63.0,1,M,31124.56,FullTime,5.0
1,1002,Milton,McPhaden,Recruiter,mmcphaden1@marriott.com,20.0,2,L,65875.74,FullTime,3.0
2,1003,Coralyn,Haselhurst,Account Coordinator,chaselhurst2@icio.us,41.0,2,3XL,25548.53,FullTime,4.0
3,1004,Morten,Samples,Account Representative IV,msamples3@toplist.cz,43.0,1,S,51447.79,PartTime,5.0
4,1005,Norman,Munnis,Desktop Support Technician,nmunnis4@cargocollective.com,41.0,0,L,54961.71,PartTime,5.0

In [105]:
myDFGrouped = myDF.groupby(['pay_type'])

To see the resulting groups, use the *groups* property, which returns a `dict` object of relevant indices within groups:

In [106]:
myDFGrouped.groups

{'FullTime': [0, 1, 2, 6, 9, 11, 12, 14, 16, 19, 21, 23, 24, 27, 29, 30, 31, 34, 36, 45, 49], 'PartTime': [3, 4, 5, 7, 8, 10, 13, 17, 18, 20, 22, 25, 26, 28, 32, 33, 35, 37, 38, 40, 41, 42, 43, 44, 46, 47, 48]}

Once grouped, you can do any number of operations such as computing *mean* (i.e., average) values for all numeric data columns:

In [107]:
myDFGrouped.mean()

,id,age,num_children,annual_salary,satisfaction_score
pay_type,,,,,
FullTime,1021.904762,40.476190,1.142857,55300.392857,2.666667
PartTime,1028.111111,42.333333,1.592593,50148.096296,3.708333

Other aggregate functions include *count* (which counts up frequencies in each column and can help identify missing data at the column-level) and a streamlined version, *size*, which applies only to the grouping variable(s):

In [108]:
myDFGrouped.count()

,id,first_name,last_name,job_title,email,age,num_children,shirt_size,annual_salary,satisfaction_score
pay_type,,,,,,,,,,
FullTime,21,21,21,21,18,21,21,21,21,21
PartTime,27,27,27,27,25,27,27,27,27,24

In [109]:
myDFGrouped.size()

pay_type
FullTime    21
PartTime    27
dtype: int64

In addition, *agg* can be used to summarise data using one or more specified functions in a list:

In [110]:
myDFGrouped.agg(['mean', 'sum'])

                   id               age         num_children      \
                 mean    sum       mean     sum         mean sum
pay_type
FullTime  1021.904762  21460  40.476190   850.0     1.142857  24
PartTime  1028.111111  27759  42.333333  1143.0     1.592593  43

         annual_salary             satisfaction_score
                  mean         sum               mean   sum
pay_type
FullTime  55300.392857  1161308.25           2.666667  56.0
PartTime  50148.096296  1353998.60           3.708333  89.0

For a full list of pandas' aggregate functions, see this [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#aggregation). Moreover, note that the *apply* method allows you to use functions from other packages as well, including NumPy's [statistics functions](https://numpy.org/devdocs/reference/routines.statistics.html):

In [111]:
# note: newer versions of numpy require explicitly selecting numeric columns beforehand to avoid a warning
myDF.groupby('pay_type')[myDF.select_dtypes('number').columns].apply(np.var) # apply NumPy's variance function

,id,age,num_children,annual_salary,satisfaction_score
pay_type,,,,,
FullTime,184.657596,226.535147,0.979592,5.952649e+08,1.269841
PartTime,214.024691,187.185185,1.426612,3.720820e+08,1.789931

Finally, as mentioned earlier, note that grouping can be nested using multiple columns simultaneously:

In [112]:
myDF.groupby(['pay_type', 'num_children']).size()

pay_type  num_children
FullTime  0               7
          1               6
          2               6
          3               2
PartTime  0               7
          1               6
          2               5
          3               9
dtype: int64

Note that missing values (i.e, `NaN`s) can cause some confusion when considering frequency counts across one or more grouping levels. See the *dropna* argument of [*groupby*](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) for one potential solution, although note that this approach requires care when dealing with categorical (i.e., `category`) data (see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#missing-data) and [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#differences-to-r-s-factor) for more details). Converting to a different data type may resolve the issue.

##### **Writing Data**

To finish up with pandas DataFrames, let's quickly discuss writing data. Similar to the discussion above regarding reading data, writing data works very similarly, with many different output formats supported (for details, see the following discussion of [input/output [IO]](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html).

For example, to write to a CSV file, use the aptly named [*to_csv*](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html) method with your DataFrame object:

In [113]:
myDFNarrowA.to_csv('output/myDFNarrowA.csv', index = False) # note: be sure to check your path (i.e., the first argument) if you run into an error

Similarly, to write an Excel file, use [*to_excel*](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_excel.html#pandas.DataFrame.to_excel):

In [114]:
# you may need to install openpyxl first; for example:
# !conda install openpyxl --y
# or
# !pip install openpyxl

In [115]:
myDFNarrowA.to_excel('output/myDFNarrowA.xlsx', index = False) # note: again, be sure to check your path (i.e., the first argument) if you run into an error

To see the output of this data, use a file manager (e.g., Finder on Mac or File Explorer on Windows) to browse to the path you specified for the output.

##### **Other DataFrame Methods**

As noted in the introduction, this bootcamp is meant to provide an overview of the core functionality when it comes to pandas DataFrames. Nevertheless, the package supports a wide range of additional, highly valuable functions, methods, etc. Again, consult the various forms of documentation provided on the [official homepage](https://pandas.pydata.org/pandas-docs/stable/index.html) for further details.

In addition, see the following pages comparing pandas to [R](https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_r.html) and [SQL](https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html) to see how functions and methods in those languages can be achieved using pandas' syntax.

#### pandas Series

In addition to DataFrames, pandas also provides an additional structure known as *Series*, which can be described as a variation of NumPy arrays. The key differentiator for Series versus arrays is that the former provides a labelled index whereas the latter can only be referenced by an integer index.

To create a Series, simply use pd.Series with the following syntax:

In [116]:
mySeries = pd.Series([5, 10, 15, 20, 25], index = ['A', 'B', 'C', 'D', 'E'])
display(mySeries, type(mySeries))

A     5
B    10
C    15
D    20
E    25
dtype: int64

pandas.core.series.Series

This series can be indexed by position, similar to an array using various indexing approaches, including slices:

In [117]:
mySeries[2] # return the 3rd value

15

In [118]:
mySeries[:3] # return the first 3 values

A     5
B    10
C    15
dtype: int64

In [119]:
mySeries[[2, 4]] # return the 3rd and 5th values

C    15
E    25
dtype: int64

Alternatively, we can index by the labelled indicies we provided while creating the Series:

In [120]:
mySeries['C']

15

In [121]:
mySeries[['C', 'E']]

C    15
E    25
dtype: int64

Otherwise, series are essentially interchangeable with NumPy arrays, which can also often be substituted with other built-in sequence types such as lists and tuples. It's ultimately up to you to decide what to use, although be aware that columns within pandas DataFrames are actually series:

In [122]:
myDFSmaller = myDF.iloc[:5, :4].copy()
myDFSmaller

     id first_name   last_name                   job_title
0  1001     Cobbie     Whinray           Account Executive
1  1002     Milton    McPhaden                   Recruiter
2  1003    Coralyn  Haselhurst         Account Coordinator
3  1004     Morten     Samples   Account Representative IV
4  1005     Norman      Munnis  Desktop Support Technician

In [123]:
type(myDFSmaller['id'])

pandas.core.series.Series